### numpy cookbook

All you quickly need to know about pandas

Dr *Gonzalo Mart√≠nez Lema*, Dr. *Marija Kekic*

January 2020

In [1]:
import numpy  as np
import pandas as pd

from IPython.display import display

In [2]:
np.random.seed(2**30)

# What are Series and dataframes

Series are sequences with arbitrary indexing (usually called label). You may use an accumulative index, which is the default and will always be available anyway

In [3]:
pd.Series(np.random.uniform(0, 1, 10)) # regular indexing

0    0.208407
1    0.159586
2    0.176314
3    0.172848
4    0.489575
5    0.087911
6    0.672792
7    0.634467
8    0.496862
9    0.063430
dtype: float64

In [4]:
pd.Series(np.random.uniform(0, 1, 10), index=list("abcdefghij"))

a    0.613779
b    0.331681
c    0.738592
d    0.581512
e    0.502831
f    0.186087
g    0.207611
h    0.453407
i    0.800152
j    0.005641
dtype: float64

In [5]:
pd.Series(np.random.uniform(0, 1, 10), index=pd.date_range('2020-01-01', '2020-01-10'))

2020-01-01    0.711367
2020-01-02    0.373343
2020-01-03    0.130544
2020-01-04    0.604448
2020-01-05    0.547716
2020-01-06    0.510271
2020-01-07    0.876447
2020-01-08    0.448488
2020-01-09    0.509646
2020-01-10    0.937491
Freq: D, dtype: float64

A dataframe is a collection of Series with a common index. Both objects are essentially fancy tables.

In [6]:
pd.DataFrame(np.random.uniform(0, 1, (10, 4)),
             columns = list("ABCD"),
             index   = pd.date_range('2020-01-01', '2020-01-10'))

                   A         B         C         D
2020-01-01  0.376770  0.511538  0.854983  0.964927
2020-01-02  0.398459  0.857465  0.681636  0.150822
2020-01-03  0.439605  0.272477  0.335329  0.201021
2020-01-04  0.239205  0.376052  0.505097  0.313976
2020-01-05  0.563956  0.018343  0.138790  0.309239
2020-01-06  0.439123  0.849035  0.380016  0.134076
2020-01-07  0.546014  0.366606  0.994385  0.620686
2020-01-08  0.890856  0.716992  0.286307  0.705534
2020-01-09  0.770099  0.195058  0.724488  0.637230
2020-01-10  0.978103  0.240068  0.443641  0.226904

# Building a Series

In [7]:
series_0 = pd.Series(data  = np.random.uniform(0, 1, 10)              ,
                     index = pd.date_range('2020-01-01', '2020-01-10'), # optional, default is regular indexing
                     dtype = np.float                                 , # optional, default is inferred
                     name  = "Minutes worked"                         ) # optional, defualt None
series_0

2020-01-01    0.997186
2020-01-02    0.303571
2020-01-03    0.620510
2020-01-04    0.669101
2020-01-05    0.392850
2020-01-06    0.779418
2020-01-07    0.761078
2020-01-08    0.018224
2020-01-09    0.378851
2020-01-10    0.702546
Freq: D, Name: Minutes worked, dtype: float64

In [8]:
series_1 = pd.Series(data  = np.random.uniform(0, 1, 10),
                     index = list("ABCDEFGHIJ")         , # optional, default is regular indexing
                     dtype = np.float                   , # optional, default is inferred
                     name  = "Letter affinity"          ) # optional, defualt None
series_1

A    0.772842
B    0.332114
C    0.213082
D    0.224244
E    0.256206
F    0.262277
G    0.413840
H    0.723919
I    0.781860
J    0.936065
Name: Letter affinity, dtype: float64

# Building a dataframe

Probably the easiest manner is to use a dictionary to combine column names with data

In [9]:
xyz_df_0 = pd.DataFrame(dict(n = np.random.poisson( 4,     10),
                             x = np.random.uniform(-2, -1, 10),
                             y = np.random.uniform( 1,  2, 10),
                             z = np.random.normal ( 0,  1, 10)),
                        index  = list("ABCDEFGHIJ"))             # optional, defaults to regular indexing
xyz_df_0

   n         x         y         z
A  1 -1.783934  1.312335 -0.141220
B  7 -1.209957  1.726180  0.406222
C  5 -1.531282  1.734366  0.399098
D  3 -1.527603  1.048225 -0.825433
E  3 -1.633019  1.755994 -0.566746
F  7 -1.291462  1.638175  1.636065
G  2 -1.760696  1.289540  0.360261
H  0 -1.565999  1.348220  0.179928
I  1 -1.492277  1.370377 -1.040732
J  4 -1.401906  1.362700  0.841173

Let's use a more realistic case and assume the index is something like an event number. We can attach a name to this index as well. Indices can repeat!

In [10]:
xyz_df_1 = pd.DataFrame(dict(n = np.random.poisson( 4,     10),
                             x = np.random.uniform(-2, -1, 10),
                             y = np.random.uniform( 1,  2, 10),
                             z = np.random.normal ( 0,  1, 10)),
                        index  = [0] * 3 + [1] * 3 + [4] * 4   )

xyz_df_1.index.name = "event" # This will be useful later

xyz_df_1

       n         x         y         z
event
0      4 -1.365096  1.988271 -0.157831
0      1 -1.545754  1.032505  1.791930
0      3 -1.980525  1.454992  1.384991
1      3 -1.087119  1.039258  1.150409
1      4 -1.015508  1.705382 -0.720407
1      4 -1.342553  1.248584  0.808755
4      4 -1.592121  1.312424  1.567267
4      4 -1.771005  1.829540  0.445264
4      5 -1.114604  1.178778  2.314880
4      3 -1.603273  1.148037 -0.363701

The same can be done with `pd.Series`

### Exercise 0: Create two or three series. Join them in a dataframe. Each row should correspond to a different time in the same day.

# Displaying a Series/DataFrame

There are a few functionalities to play around with Series and DataFrames. These work for both

In [11]:
xyz_df_0.head()

   n         x         y         z
A  1 -1.783934  1.312335 -0.141220
B  7 -1.209957  1.726180  0.406222
C  5 -1.531282  1.734366  0.399098
D  3 -1.527603  1.048225 -0.825433
E  3 -1.633019  1.755994 -0.566746

In [12]:
xyz_df_0.tail()

   n         x         y         z
F  7 -1.291462  1.638175  1.636065
G  2 -1.760696  1.289540  0.360261
H  0 -1.565999  1.348220  0.179928
I  1 -1.492277  1.370377 -1.040732
J  4 -1.401906  1.362700  0.841173

You can know the columns of a DataFrame as

In [13]:
xyz_df_0.columns

Index(['n', 'x', 'y', 'z'], dtype='object')

And the shape (nrows, ncols) as

In [14]:
xyz_df_0.shape

(10, 4)

# Statistics

In [15]:
series_0.describe() # get a series that gives stat info about the data

count    10.000000
mean      0.562333
std       0.285884
min       0.018224
25%       0.382351
50%       0.644805
75%       0.746445
max       0.997186
Name: Minutes worked, dtype: float64

In [16]:
xyz_df_0.describe() # get a dataframe that gives stat info about each column

               n          x          y          z
count  10.000000  10.000000  10.000000  10.000000
mean    3.300000  -1.519813   1.458611   0.124862
std     2.451757   0.184313   0.239417   0.804186
min     0.000000  -1.783934   1.048225  -1.040732
25%     1.250000  -1.616264   1.321306  -0.460364
50%     3.000000  -1.529442   1.366538   0.270095
75%     4.750000  -1.424499   1.704179   0.404441
max     7.000000  -1.209957   1.755994   1.636065

In [17]:
print(f"""For series_0:
mean = {series_0.mean()}
std  = {series_0.std ()}
min  = {series_0.min ()}
max  = {series_0.max ()}
half = {series_0.quantile(0.5)}
len  = {series_0.count()} = {series_0.size}
""")

For series_0:
mean = 0.5623334017931774
std  = 0.28588441272971526
min  = 0.018223745054262386
max  = 0.9971857724901511
half = 0.6448052327816083
len  = 10 = 10

Same can be used for a dataframe, producing a Series with the value for each column

In [18]:
xyz_df_0.mean()

n    3.300000
x   -1.519813
y    1.458611
z    0.124862
dtype: float64

# Indexing

### By position or index/label

In [19]:
series_1["A"] # by label

0.7728424215328034

This works only for series. Dataframes interpret the argument as a column name

In [20]:
try:
    xyz_df_0["A"]
except KeyError as error:
    print("KeyError:", error)

KeyError: 'A'

In [21]:
xyz_df_0["x"] # This produces a Series

A   -1.783934
B   -1.209957
C   -1.531282
D   -1.527603
E   -1.633019
F   -1.291462
G   -1.760696
H   -1.565999
I   -1.492277
J   -1.401906
Name: x, dtype: float64

`[]` is good for playing around, but you don't know if what you are getting is a copy or a view. For serious stuff it is better to use `loc` and `iloc`, which should be as fast (if not faster) and you are guaranteed to get a view (i.e. the same memory positions). This means that modifications to the object you get affect the original one.

In [22]:
series_1.loc["D"] # by label

0.22424383187208163

In [23]:
series_1.iloc[3] # by position, i.e. row number

0.22424383187208163

In [24]:
xyz_df_0.loc["D"] # by label

n    3.000000
x   -1.527603
y    1.048225
z   -0.825433
Name: D, dtype: float64

In [25]:
xyz_df_0.iloc[3] # by position, i.e. row number

n    3.000000
x   -1.527603
y    1.048225
z   -0.825433
Name: D, dtype: float64

These methods also work with arrays

In [26]:
series_0.iloc[[1, 5, 6]] # by position

2020-01-02    0.303571
2020-01-06    0.779418
2020-01-07    0.761078
Name: Minutes worked, dtype: float64

Or slices!

In [27]:
series_0.iloc[3:6]

2020-01-04    0.669101
2020-01-05    0.392850
2020-01-06    0.779418
Freq: D, Name: Minutes worked, dtype: float64

For dataframes, rows are columns can be selected simultaneously. Also, the indices or columns do not need to be in the same order as the df

In [28]:
xyz_df_0.loc[list("EAC"), list("zx")]

          z         x
E -0.566746 -1.633019
A -0.141220 -1.783934
C  0.399098 -1.531282

Because `loc` returns a view, the original object can be modified. We use a slice range to modify one of the columns of the dataframe

This is important when having to perform many operations on big dataframes, as the copy operations introduce a huge overhead

In [29]:
xyz_df_2 = xyz_df_0.copy()
xyz_df_2

   n         x         y         z
A  1 -1.783934  1.312335 -0.141220
B  7 -1.209957  1.726180  0.406222
C  5 -1.531282  1.734366  0.399098
D  3 -1.527603  1.048225 -0.825433
E  3 -1.633019  1.755994 -0.566746
F  7 -1.291462  1.638175  1.636065
G  2 -1.760696  1.289540  0.360261
H  0 -1.565999  1.348220  0.179928
I  1 -1.492277  1.370377 -1.040732
J  4 -1.401906  1.362700  0.841173

In [30]:
xyz_df_2.loc["D":"I", "y"] *= 100

In [31]:
xyz_df_2

   n         x           y         z
A  1 -1.783934    1.312335 -0.141220
B  7 -1.209957    1.726180  0.406222
C  5 -1.531282    1.734366  0.399098
D  3 -1.527603  104.822471 -0.825433
E  3 -1.633019  175.599378 -0.566746
F  7 -1.291462  163.817487  1.636065
G  2 -1.760696  128.953989  0.360261
H  0 -1.565999  134.822013  0.179928
I  1 -1.492277  137.037666 -1.040732
J  4 -1.401906    1.362700  0.841173

### Exercise 1: copy xyz_df_0 to xyz_df_3 and replace each value of x, y, z, with a normalized value (i.e. subtract mean and divide by std)

### Indexing with default value

In [32]:
series_1.get("A", np.nan) # Exists, returns value

0.7728424215328034

In [33]:
series_1.get("dog", np.nan) # Does not exist, returns default

nan

For dataframes we access columns!

In [34]:
xyz_df_0.get("x") # Exists, returns the column

A   -1.783934
B   -1.209957
C   -1.531282
D   -1.527603
E   -1.633019
F   -1.291462
G   -1.760696
H   -1.565999
I   -1.492277
J   -1.401906
Name: x, dtype: float64

In [35]:
xyz_df_0.get("t", 1) # Does not exists, returns default

1

### Indexing with row-column pairs

In [36]:
rows    = ["A", "C", "I", "H", "B"]
columns = ['x', 'x', 'y', 'z', 'z']

xyz_df_0.lookup(rows, columns)
# Take x from row A
# Take x from row C
# Take y from row I
# Take z from row H
# Take z from row B

array([-1.78393364, -1.53128159,  1.37037666,  0.17992838,  0.40622229])

### Fast single-element indexing

This method should only be used for accessing a reduced number of elements. Long iterations using this method are very (very) slow.

In [37]:
series_1.iat[4], series_1.at["E"] # position and label

(0.25620561005620135, 0.25620561005620135)

In [38]:
xyz_df_0.iat[4, 2], xyz_df_0.at["E", "z"] # position and label

(1.7559937799700331, -0.5667455389663283)

### Selection by booleans

Essentially the same as for numpy

In [39]:
mask = series_0 > 0.5
series_0[mask]

2020-01-01    0.997186
2020-01-03    0.620510
2020-01-04    0.669101
2020-01-06    0.779418
2020-01-07    0.761078
2020-01-10    0.702546
Name: Minutes worked, dtype: float64

In [40]:
mask  = xyz_df_0.x > -1.5
mask &= xyz_df_0.y <  1.5
mask &= xyz_df_0.z > xyz_df_0.z.quantile(0.5)

In [41]:
xyz_df_0[mask] # This is a copy! Use loc to avoid it

   n         x       y         z
J  4 -1.401906  1.3627  0.841173

### Selection by query

This method is not of common use. In words of the developers:
```
A use case for query() is when you have a collection of DataFrame objects that have a subset of column      names (or index levels/names) in common. You can pass the same query to both frames without having to      specify which frame you‚Äôre interested in querying
```
Which is not a frequent scenario. Avoid using it unless you find yourself doing something like this.

In [42]:
quantile = xyz_df_0.z.quantile(0.6)
xyz_df_0.query(f"x < -1.5 & y > 1.5 & z > {quantile}")

   n         x         y         z
C  5 -1.531282  1.734366  0.399098

### Exercise 2: select from the following dataframe those rows that have exactly 1 of the values in the provided list

In [43]:
df_with_ints = pd.DataFrame(dict(x = np.random.poisson(5, 10),
                                 y = np.random.poisson(2, 10),
                                 z = np.random.poisson(8, 10)))

list_of_ints = [1, 4, 5, 9]
df_with_ints

   x  y   z
0  2  5  11
1  5  2   3
2  2  2   7
3  5  0   9
4  7  3   7
5  4  1   5
6  6  2   6
7  4  1  11
8  6  1  10
9  4  3   4

### Useful functions for selections

In [44]:
xyz_df_0.n.isin([4, 5]) # True if value is in the provided list, False otherwise

A    False
B    False
C     True
D    False
E    False
F    False
G    False
H    False
I    False
J     True
Name: n, dtype: bool

In [45]:
series_2 = series_0.copy()
series_2.iloc[3::3] = np.nan
series_2.isna() # True if value is a NaN They can also be dropped with series.dropna()

2020-01-01    False
2020-01-02    False
2020-01-03    False
2020-01-04     True
2020-01-05    False
2020-01-06    False
2020-01-07     True
2020-01-08    False
2020-01-09    False
2020-01-10     True
Freq: D, Name: Minutes worked, dtype: bool

In [46]:
xyz_df_0.n.duplicated()
# True if the is duplicated. Default is to mark as duplicated only 2nd, 3rd, ... occurrences
# Check docs for other options

A    False
B    False
C    False
D    False
E     True
F     True
G    False
H    False
I     True
J    False
Name: n, dtype: bool

# Sampling

We can take samples from a series

In [47]:
series_0.sample()

2020-01-06    0.779418
Freq: D, Name: Minutes worked, dtype: float64

Or many at a time

In [48]:
xyz_df_0.sample(3)

   n         x         y         z
F  7 -1.291462  1.638175  1.636065
C  5 -1.531282  1.734366  0.399098
J  4 -1.401906  1.362700  0.841173

Or a fraction of the total

In [49]:
series_1.sample(frac=0.334)

C    0.213082
I    0.781860
H    0.723919
Name: Letter affinity, dtype: float64

# Combining data

### Row-wise

In [50]:
first_events = xyz_df_0.iloc[  :3]
last_events  = xyz_df_1.iloc[-3: ]
display(first_events, last_events)

   n         x         y         z
A  1 -1.783934  1.312335 -0.141220
B  7 -1.209957  1.726180  0.406222
C  5 -1.531282  1.734366  0.399098

       n         x         y         z
event
4      4 -1.771005  1.829540  0.445264
4      5 -1.114604  1.178778  2.314880
4      3 -1.603273  1.148037 -0.363701

In [51]:
pd.concat([first_events, last_events]) # New dataframe

   n         x         y         z
A  1 -1.783934  1.312335 -0.141220
B  7 -1.209957  1.726180  0.406222
C  5 -1.531282  1.734366  0.399098
4  4 -1.771005  1.829540  0.445264
4  5 -1.114604  1.178778  2.314880
4  3 -1.603273  1.148037 -0.363701

The same can be achieved with `append`

In [52]:
first_events.append(last_events) # new dataframe!

   n         x         y         z
A  1 -1.783934  1.312335 -0.141220
B  7 -1.209957  1.726180  0.406222
C  5 -1.531282  1.734366  0.399098
4  4 -1.771005  1.829540  0.445264
4  5 -1.114604  1.178778  2.314880
4  3 -1.603273  1.148037 -0.363701

You may also append (or concat) a series

In [53]:
first_events.append(xyz_df_1.iloc[4]) # new dataframe!

     n         x         y         z
A  1.0 -1.783934  1.312335 -0.141220
B  7.0 -1.209957  1.726180  0.406222
C  5.0 -1.531282  1.734366  0.399098
1  4.0 -1.015508  1.705382 -0.720407

### Column-wise

In [54]:
first_columns = xyz_df_1.iloc[:,   :1]
last_columns  = xyz_df_1.iloc[:, -2: ]
display(first_columns, last_columns)

       n
event
0      4
0      1
0      3
1      3
1      4
1      4
4      4
4      4
4      5
4      3

              y         z
event
0      1.988271 -0.157831
0      1.032505  1.791930
0      1.454992  1.384991
1      1.039258  1.150409
1      1.705382 -0.720407
1      1.248584  0.808755
4      1.312424  1.567267
4      1.829540  0.445264
4      1.178778  2.314880
4      1.148037 -0.363701

In [55]:
pd.concat([first_columns, last_columns], axis=1) # New dataframe

       n         y         z
event
0      4  1.988271 -0.157831
0      1  1.032505  1.791930
0      3  1.454992  1.384991
1      3  1.039258  1.150409
1      4  1.705382 -0.720407
1      4  1.248584  0.808755
4      4  1.312424  1.567267
4      4  1.829540  0.445264
4      5  1.178778  2.314880
4      3  1.148037 -0.363701

If there are repeated columns the default behaviour is to keep both (`join="outer"`). Use `join="inner"` to keep the intersection.

You may also concatenate a series to a dataframe

In [56]:
pd.concat([first_columns, xyz_df_1.y], axis=1)

       n         y
event
0      4  1.988271
0      1  1.032505
0      3  1.454992
1      3  1.039258
1      4  1.705382
1      4  1.248584
4      4  1.312424
4      4  1.829540
4      5  1.178778
4      3  1.148037

### Exercise 3: join `xyz_df_0` and `xyz_df_2` using `join="outer"`

In [57]:
display(xyz_df_0, xyz_df_2)

   n         x         y         z
A  1 -1.783934  1.312335 -0.141220
B  7 -1.209957  1.726180  0.406222
C  5 -1.531282  1.734366  0.399098
D  3 -1.527603  1.048225 -0.825433
E  3 -1.633019  1.755994 -0.566746
F  7 -1.291462  1.638175  1.636065
G  2 -1.760696  1.289540  0.360261
H  0 -1.565999  1.348220  0.179928
I  1 -1.492277  1.370377 -1.040732
J  4 -1.401906  1.362700  0.841173

   n         x           y         z
A  1 -1.783934    1.312335 -0.141220
B  7 -1.209957    1.726180  0.406222
C  5 -1.531282    1.734366  0.399098
D  3 -1.527603  104.822471 -0.825433
E  3 -1.633019  175.599378 -0.566746
F  7 -1.291462  163.817487  1.636065
G  2 -1.760696  128.953989  0.360261
H  0 -1.565999  134.822013  0.179928
I  1 -1.492277  137.037666 -1.040732
J  4 -1.401906    1.362700  0.841173

# Grouping data

Usually we want to perform operations to groups of data. The most common cases is "I want to do this event by event" or "peak by peak". The easiest way is to use `groupby`.

In [58]:
display(xyz_df_1)
groups = xyz_df_1.groupby("event")

k = 0
for event_no, subdf in groups:
    display(subdf)

       n         x         y         z
event
0      4 -1.365096  1.988271 -0.157831
0      1 -1.545754  1.032505  1.791930
0      3 -1.980525  1.454992  1.384991
1      3 -1.087119  1.039258  1.150409
1      4 -1.015508  1.705382 -0.720407
1      4 -1.342553  1.248584  0.808755
4      4 -1.592121  1.312424  1.567267
4      4 -1.771005  1.829540  0.445264
4      5 -1.114604  1.178778  2.314880
4      3 -1.603273  1.148037 -0.363701

       n         x         y         z
event
0      4 -1.365096  1.988271 -0.157831
0      1 -1.545754  1.032505  1.791930
0      3 -1.980525  1.454992  1.384991

       n         x         y         z
event
1      3 -1.087119  1.039258  1.150409
1      4 -1.015508  1.705382 -0.720407
1      4 -1.342553  1.248584  0.808755

       n         x         y         z
event
4      4 -1.592121  1.312424  1.567267
4      4 -1.771005  1.829540  0.445264
4      5 -1.114604  1.178778  2.314880
4      3 -1.603273  1.148037 -0.363701

We can also group by more than one label

In [59]:
groups = xyz_df_1.groupby(["event", "n"])

k = 0
for (event_no, peak_no), subdf in groups:
    display(subdf)

       n         x         y        z
event
0      1 -1.545754  1.032505  1.79193

       n         x         y         z
event
0      3 -1.980525  1.454992  1.384991

       n         x         y         z
event
0      4 -1.365096  1.988271 -0.157831

       n         x         y         z
event
1      3 -1.087119  1.039258  1.150409

       n         x         y         z
event
1      4 -1.015508  1.705382 -0.720407
1      4 -1.342553  1.248584  0.808755

       n         x         y         z
event
4      3 -1.603273  1.148037 -0.363701

       n         x         y         z
event
4      4 -1.592121  1.312424  1.567267
4      4 -1.771005  1.829540  0.445264

       n         x         y        z
event
4      5 -1.114604  1.178778  2.31488

If we are interested in a specific group, not all of them, we can also get them

In [60]:
groups.get_group((1, 4)) # event=1, n=5

       n         x         y         z
event
1      4 -1.015508  1.705382 -0.720407
1      4 -1.342553  1.248584  0.808755

# Applying operations on each group

We can get generic properties of each grup easily

In [61]:
groups = xyz_df_1.groupby("event")
groups.size() # Count rows in each group

event
0    3
1    3
4    4
dtype: int64

In [62]:
groups.mean()

              n         x         y         z
event
0      2.666667 -1.630458  1.491923  1.006363
1      3.666667 -1.148393  1.331075  0.412919
4      4.000000 -1.520251  1.367195  0.990927

We can get it for a specific column as well (faster if you don't need to apply the same operation onto many columns)

In [63]:
groups.x.mean() # groups["x"] would also work

event
0   -1.630458
1   -1.148393
4   -1.520251
Name: x, dtype: float64

We can also produce a new dataframe with this information with `aggregate`

In [64]:
groups.aggregate(np.sum) # Produce a dataframe indexed with event and summing all entries in each column

        n         x         y         z
event
0       8 -4.891375  4.475768  3.019090
1      11 -3.445179  3.993224  1.238758
4      16 -6.081004  5.468779  3.963710

We may want to apply different operations to different columns

In [65]:
groups.aggregate(dict(n=np.sum, x=np.mean, y="min", z="first"))
# Same, but only with the specified operation to each column

        n         x         y         z
event
0       8 -1.630458  1.032505 -0.157831
1      11 -1.148393  1.039258  1.150409
4      16 -1.520251  1.148037  1.567267

You may also want to get many properties of the same data

In [66]:
groups.x.aggregate([np.mean, np.std, "count"]) # produce a df with these columns for each group

           mean       std  count
event
0     -1.630458  0.316338      3
1     -1.148393  0.171917      3
4     -1.520251  0.282539      4

It also works for a dataframe, but it gets messy

In [67]:
groups.aggregate(["min", "max"]) # Produce dataframe with two column levels

        n             x                   y                   z
      min max       min       max       min       max       min       max
event
0       1   4 -1.980525 -1.365096  1.032505  1.988271 -0.157831  1.791930
1       3   4 -1.342553 -1.015508  1.039258  1.705382 -0.720407  1.150409
4       3   5 -1.771005 -1.114604  1.148037  1.829540 -0.363701  2.314880

You don't like these names? No problem!

In [68]:
groups.aggregate(dict(n=np.sum, x=np.mean, y="min", z="first"))\
      .rename(columns = dict(n = "sum_n", x = "av_x", y = "min_y", z = "first_z"))

       sum_n      av_x     min_y   first_z
event
0          8 -1.630458  1.032505 -0.157831
1         11 -1.148393  1.039258  1.150409
4         16 -1.520251  1.148037  1.567267

Naturally, you can use your functions. They must take an array (dataframe) and return a scalar (series). Warning, this might be super slow!

In [69]:
def weird_function(x):
    return -1 if np.sum(x) < -2 else +1

In [70]:
groups.z.aggregate([lambda x: np.max(x) - np.min(x), weird_function, np.sum])

       <lambda>  weird_function       sum
event
0      1.949761             1.0  3.019090
1      1.870816             1.0  1.238758
4      2.678581             1.0  3.963710

This however, creates a problem when we try to add this group-dependent information to the original dataframe:

In [71]:
sum_n = xyz_df_1.groupby("event").n.aggregate("sum") # same as xyz_df_1.groupby("event").n.sum()
xyz_df_1.shape[0], sum_n.shape[0]

(10, 3)

This can be avoided using transform:

In [72]:
sum_n = xyz_df_1.groupby("event").n.transform("sum") # same as xyz_df_1.groupby("event").n.sum()
xyz_df_1.shape[0], sum_n.shape[0]

(10, 10)

This way we can add this information to the original dataframe

In [73]:
xyz_df_1.loc[:, "sum_n"] = xyz_df_1.groupby("event").n.transform(np.sum)

In [74]:
xyz_df_1

       n         x         y         z  sum_n
event
0      4 -1.365096  1.988271 -0.157831      8
0      1 -1.545754  1.032505  1.791930      8
0      3 -1.980525  1.454992  1.384991      8
1      3 -1.087119  1.039258  1.150409     11
1      4 -1.015508  1.705382 -0.720407     11
1      4 -1.342553  1.248584  0.808755     11
4      4 -1.592121  1.312424  1.567267     16
4      4 -1.771005  1.829540  0.445264     16
4      5 -1.114604  1.178778  2.314880     16
4      3 -1.603273  1.148037 -0.363701     16

The function used in transform can either:
- Return a single value, in which case, the value is broadcasted to match the size of the group
- Return an array of values of the same size of the group. Each value get's assigned to the corresponding entry

In [75]:
xyz_df_1.groupby("event").z.transform(lambda v: v - v.min())

event
0    0.000000
0    1.949761
0    1.542822
1    1.870816
1    0.000000
1    1.529162
4    1.930968
4    0.808965
4    2.678581
4    0.000000
Name: z, dtype: float64

### *** Warning
* Using functions that are not "standard" increases the execution time. Avoid it whenever possible.
* This is because the standard ones are optimized by Cython. If you implement your custom function in cython (or if you cythonize it inline) it should be as fast

A good use of this method is to replace NaN values with, for example, the average value of each event.
### Exercise 4: Use `transform` to do so with the following dataframe.

In [76]:
event = np.repeat(np.arange(5), 4)
x     = np.random.uniform(-1, 1, 20)
y     = np.random.uniform(-1, 1, 20)
x[[0, 5, 10, 15]] = np.nan
y[[4, 7, 10, 12]] = np.nan
df_with_nans = pd.DataFrame(dict(x=x, y=y), index=event)
df_with_nans

          x         y
0       NaN -0.068416
0  0.961070 -0.370813
0 -0.144505 -0.244542
0  0.964630 -0.120623
1 -0.587404       NaN
1       NaN  0.267088
1  0.598699 -0.944999
1 -0.791539       NaN
2  0.884814  0.335130
2 -0.895901 -0.209618
2       NaN       NaN
2 -0.678138  0.648578
3 -0.483804       NaN
3  0.994899 -0.302671
3  0.172032 -0.885604
3       NaN  0.039345
4 -0.314172  0.287212
4 -0.396150 -0.980129
4  0.318385 -0.789725
4 -0.733199  0.144722

# Filtering groups

In [77]:
xyz_df_1.groupby("event").filter(lambda g: np.any(g.z) > 0)
# produces a new df by concatenating the groups that satisfy the condition concatenated

       n         x         y         z  sum_n
event
0      4 -1.365096  1.988271 -0.157831      8
0      1 -1.545754  1.032505  1.791930      8
0      3 -1.980525  1.454992  1.384991      8
1      3 -1.087119  1.039258  1.150409     11
1      4 -1.015508  1.705382 -0.720407     11
1      4 -1.342553  1.248584  0.808755     11
4      4 -1.592121  1.312424  1.567267     16
4      4 -1.771005  1.829540  0.445264     16
4      5 -1.114604  1.178778  2.314880     16
4      3 -1.603273  1.148037 -0.363701     16

# Apply / applymap / map

- `apply` is used to generate new values from a dataframe from a function column- or row-wise. The function may or may not reduce the data
- `applymap` same but element-wise. It cannot reduce the data
- `map` is used to translate values

In [78]:
xyz_df_1.apply(lambda x: np.sqrt(np.sum(x**2)), axis=0) # default

n        11.532563
x         4.655641
y         4.523363
z         3.974439
sum_n    39.736633
dtype: float64

In [79]:
xyz_df_1.apply(lambda x: np.sqrt(np.sum(x**2)), axis=1)

event
0     9.265075
0     8.465603
0     8.997649
1    11.557912
1    11.893636
1    11.874994
4    16.694719
4    16.693769
4    16.999721
4    16.401852
dtype: float64

In [80]:
xyz_df_1.applymap(lambda x: np.sqrt(np.abs(x)))

              n         x         y         z     sum_n
event
0      2.000000  1.168373  1.410061  0.397280  2.828427
0      1.000000  1.243284  1.016122  1.338630  2.828427
0      1.732051  1.407311  1.206231  1.176856  2.828427
1      1.732051  1.042650  1.019440  1.072571  3.316625
1      2.000000  1.007724  1.305903  0.848768  3.316625
1      2.000000  1.158686  1.117400  0.899308  3.316625
4      2.000000  1.261793  1.145611  1.251905  4.000000
4      2.000000  1.330791  1.352605  0.667281  4.000000
4      2.236068  1.055748  1.085716  1.521473  4.000000
4      1.732051  1.266204  1.071465  0.603076  4.000000

In [81]:
mapping = {0: -1, 1: 10, 2: np.pi, 3: 44, 4:123, 5:1e3} # Missing values go missing!
xyz_df_1.loc[:, ["n"]].applymap(mapping.get) # Notice the list in `loc`: If forces the result to be a dataframe

            n
event
0       123.0
0        10.0
0        44.0
1        44.0
1       123.0
1       123.0
4       123.0
4       123.0
4      1000.0
4        44.0

In [82]:
mapping = {0: -1, 1: 10, 2: np.pi, 3: 44, 4:123, 5:1e3}
xyz_df_1.n.map(mapping)

event
0     123.0
0      10.0
0      44.0
1      44.0
1     123.0
1     123.0
4     123.0
4     123.0
4    1000.0
4      44.0
Name: n, dtype: float64

In [83]:
min_z = xyz_df_1.z.min()
xyz_df_1.z.map(lambda zz: zz - min_z)

event
0    0.562576
0    2.512336
0    2.105398
1    1.870816
1    0.000000
1    1.529162
4    2.287674
4    1.165671
4    3.035286
4    0.356706
Name: z, dtype: float64

### Exercise 5: create a dataframe with the average position of each event in XYZ. Then compute the R and Phi positions of these average values.

### Exercise 6: Repeat the previous exercise but adding those values to the original df

from invisible_cities.io.dst_io import load_dst

# Increase the number of displayed columns to 100
pd.set_option("display.max_columns", 100)

filename = "/media/gonzalo/Gonzalo128/data/NEXT/ECEC/bkg/kdst_7007_v0.9.9_20190111_krbg.h5"
df = load_dst(filename, "DST", "Events")
del df["index"] # ignore this
df = df.set_index("event")

df.head()

series = df.S2w.copy()

series.head()